app/Controllers/AchatController.php

    public function index()
    {
        $data = [
            'titre' => 'Liste des achats',
        ];

        $modelProduit = new ProduiModel();
        $data['produits'] = $modelProduit->findAll();
---
SELECT *
FROM `produit`