app/Controllers/AchatController.php

    public function ajouter()
    {
        $caisseId  = session()->get('caisse_active');
        $produitId = $this->request->getPost('produit_id');
        $quantite  = (int) $this->request->getPost('quantite');

        if (!$caisseId) {
            return redirect()->to('/caisse');
        }

        if (!$produitId || $quantite < 1) {
            return redirect()->to('/achats')->with('erreur', 'Produit ou quantité invalide.');
        }

        $panierModel = new PanierModel();
        $achatModel  = new AchatModel();

        $panierId = $panierModel->insert([
            'produit_id' => $produitId,
            'quantite'   => $quantite,
        ]);

        $achatModel->insert([
            'caisse_id' => $caisseId,
            'panier_id' => $panierId,
            'statut'    => 'en_cours',
        ]);
---
INSERT INTO `panier` (`produit_id`, `quantite`) VALUES ('1', 1)
INSERT INTO `achat` (`caisse_id`, `panier_id`, `statut`) VALUES ('1', 6, 'en_cours')