app/Controllers/CaisseController.php

SELECT *
FROM `caisse`
---
    public function index()
    {
        $caisseModel = new CaisseModel();
        $allCaisse = $caisseModel->findAll();