app/Controllers/EmployeController.php

    public function profil()
    {
        helper('form');
        $session = session();
        $employeId = $session->get('id');

        $employeModel = new EmployeModel();
        $data['employe'] = $employeModel->find($employeId);
---
SELECT *
FROM `employes`
WHERE `employes`.`id` = 3