app/Models/AchatModel.php

    public function getAchatsEnCoursParCaisse(int $caisseId): array
    {
        return $this->select('achat.id, achat.statut, panier.quantite, produit.id as produit_id, produit.designation, produit.prix')
            ->join('panier', 'panier.id = achat.panier_id')
            ->join('produit', 'produit.id = panier.produit_id')
            ->where('achat.caisse_id', $caisseId)
            ->where('achat.statut', 'en_cours')
            ->findAll();
---
SELECT `achat`.`id`, `achat`.`statut`, `panier`.`quantite`, `produit`.`id` as `produit_id`, `produit`.`designation`, `produit`.`prix`
FROM `achat`
JOIN `panier` ON `panier`.`id` = `achat`.`panier_id`
JOIN `produit` ON `produit`.`id` = `panier`.`produit_id`
WHERE `achat`.`caisse_id` = 1
AND `achat`.`statut` = 'en_cours'

    public function cloturerParCaisse(int $caisseId): bool
    {
        return $this->where('caisse_id', $caisseId)
            ->where('statut', 'en_cours')
            ->set(['statut' => 'cloture'])
            ->update();
---
UPDATE `achat` SET `statut` = 'cloture'
WHERE `caisse_id` = 1
AND `statut` = 'en_cours'