app/Models/CongeModel.php

    public function getCongesByEmploye($employeId)
    {
        return $this->select('conges.*, types_conge.libelle as type_conge')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('employe_id', $employeId)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT `conges`.*, `types_conge`.`libelle` as `type_conge`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `employe_id` = 3
ORDER BY `created_at` DESC

    public function congeGroupByType($user)
    {
        return $this->select('types_conge.libelle, SUM(conges.nb_jours) as total_jours, COUNT(conges.id) as total_demandes')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id', 'INNER')
            ->where('employe_id', $user)
            ->groupBy('types_conge.libelle')
            ->findAll();
---
SELECT `types_conge`.`libelle`, SUM(conges.nb_jours) as total_jours, COUNT(conges.id) as total_demandes
FROM `conges`
INNER JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `employe_id` = 3
GROUP BY `types_conge`.`libelle`